default_state_book_collector = [
            ('books_genre', {}),
            ('favorites', []),
            ('genre', ['Фантастика', 'Ужасы', 'Детективы', 'Мультфильмы', 'Комедии']),
            ('genre_age_rating', ['Ужасы', 'Детективы'])
        ]

book_names = ['Гордость и предубеждение и зомби',
              'Что делать, если ваш кот хочет вас убить',
              'Как я встретил вашу маму']

genre_names = ['Ужасы', 'Ужасы', 'Комедии']

book_bad_names = ['', 'Длинное название, длина равна 41 символу.']

test_params = [
    ['Гордость и предубеждение и зомби', 'Ужасы'],
    ['Что делать, если ваш кот хочет вас убить', 'Ужасы'],
    ['Как я встретил вашу маму', 'Комедии']]
